bus.on('是否忽略Sheet', function (name){

    if (    /^\s*[×✖]/.test(name) // Sheet名称用删除符号注明删除
         || /^\s*([【（<＜《(]×[】）＞>》)]|[【（<＜《(]✖[】）＞>》)])/i.test(name) // 括号内删除符号注明删除
         || /^\s*([【（<＜《(]删除[】）＞>》)]|[【（<＜《(]废弃[】）＞>》)]|[【（<＜《(]忽略[】）＞>》)]|[【（<＜《(]无视[】）＞>》)])/i.test(name) // 文字注明删除
         || /^\s*([【（<＜《(]削除[】）＞>》)]|[【（<＜《(]廃棄[】）＞>》)]|[【（<＜《(]廃止[】）＞>》)]|[【（<＜《(]無視[】）＞>》)])/i.test(name)
         || /^\s*([【（<＜《(]delete[】）＞>》)]|[【（<＜《(]ignore[】）＞>》)]|[【（<＜《(]ignored[】）＞>》)])/i.test(name)
         || /^\s*$/.test(name) // Sheet名称空白
        ) {
        return true;
    }

    return false;
});
